CSI API ETABS v1

# cFrameObjSetLoadPoint Method

---

Assigns point loads to frame objects.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetLoadPoint(
    	string Name,
    	string LoadPat,
    	int MyType,
    	int Dir,
    	double Dist,
    	double Val,
    	string CSys = "Global",
    	bool RelDist = true,
    	bool Replace = true,
    	eItemType ItemType = eItemType.Objects
    )

    Function SetLoadPoint (
    	Name As String,
    	LoadPat As String,
    	MyType As Integer,
    	Dir As Integer,
    	Dist As Double,
    	Val As Double,
    	Optional CSys As String = "Global",
    	Optional RelDist As Boolean = true,
    	Optional Replace As Boolean = true,
    	Optional ItemType As eItemType = eItemType.Objects
    ) As Integer

    Dim instance As cFrameObj
    Dim Name As String
    Dim LoadPat As String
    Dim MyType As Integer
    Dim Dir As Integer
    Dim Dist As Double
    Dim Val As Double
    Dim CSys As String
    Dim RelDist As Boolean
    Dim Replace As Boolean
    Dim ItemType As eItemType
    Dim returnValue As Integer

    returnValue = instance.SetLoadPoint(Name,
    	LoadPat, MyType, Dir, Dist, Val, CSys,
    	RelDist, Replace, ItemType)

    int SetLoadPoint(
    	String^ Name,
    	String^ LoadPat,
    	int MyType,
    	int Dir,
    	double Dist,
    	double Val,
    	String^ CSys = L"Global",
    	bool RelDist = true,
    	bool Replace = true,
    	eItemType ItemType = eItemType::Objects
    )

    abstract SetLoadPoint :
            Name : string *
            LoadPat : string *
            MyType : int *
            Dir : int *
            Dist : float *
            Val : float *
            ?CSys : string *
            ?RelDist : bool *
            ?Replace : bool *
            ?ItemType : eItemType
    (* Defaults:
            let _CSys = defaultArg CSys "Global"
            let _RelDist = defaultArg RelDist true
            let _Replace = defaultArg Replace true
            let _ItemType = defaultArg ItemType eItemType.Objects
    *)
    -> int

#### Parameters

Name

    Type: SystemString
The name of an existing frame object or group, depending on the value of the
ItemType item.

LoadPat

    Type: SystemString
The name of a defined load pattern.

MyType

    Type: SystemInt32
This is 1 or 2, indicating the type of point load.

  1. Force
  2. Moment

Dir

    Type: SystemInt32
This is an integer between 1 and 11, indicating the direction of the load.

  1. Local 1 axis (only applies when CSys is Local)
  2. Local 2 axis (only applies when CSys is Local)
  3. Local 3 axis (only applies when CSys is Local)
  4. X direction (does not apply when CSys is Local)
  5. Y direction (does not apply when CSys is Local)
  6. Z direction (does not apply when CSys is Local)
  7. Not used - Projected X direction (does not apply when CSys is Local)
  8. Not used - Projected Y direction (does not apply when CSys is Local)
  9. Not used - Projected Z direction (does not apply when CSys is Local)
  10. Gravity direction (only applies when CSys is Global)
  11. Not used - Projected Gravity direction (only applies when CSys is Global)

The positive gravity direction (see Dir = 10 and 11) is in the negative Global
Z direction.

Dist

    Type: SystemDouble
This is the distance from the I-End of the frame object to the load location.
This may be a relative distance (0 <= Dist1 <= 1) or an actual distance,
depending on the value of the RelDist item. [L] when RelDist is False

Val

    Type: SystemDouble
This is the value of the point load. [F] when MyType is 1 and [FL] when MyType
is 2

CSys (Optional)

    Type: SystemString
This is Local or the name of a defined coordinate system. It is the coordinate
system in which the loads are specified.

RelDist (Optional)

    Type: SystemBoolean
If this item is True, the specified Dist item is a relative distance,
otherwise it is an actual distance.

Replace (Optional)

    Type: SystemBoolean
If this item is True, all previous loads, if any, assigned to the specified
frame object(s), in the specified load pattern, are deleted before making the
new assignment.

ItemType (Optional)

    Type: ETABSv1eItemType
This is one of the following items in the
eItemType enumeration:

  * Object = 0
  * Group = 1
  * SelectedObjects = 2

If this item is Objects, the
assignment is made to the frame object specified by the Name item.

If this item is Group, the
assignment is made to all frame objects in the group specified by the Name
item.

If this item is SelectedObjects,
the assignment is made to all selected frame objects and the Name item is
ignored.

#### Return Value

Type: Int32
Returns zero if the loads are successfully assigned, otherwise it returns a
nonzero value.

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'assign frame point loads
       ret = SapModel.FrameObj.SetLoadPoint("15", "DEAD", 1, 10, .5, 20)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cFrameObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com